work/log.ltccip8.2020-06-14_0656/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-110-1
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=110 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 110

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140308
        write:                           0
        other:                           20044
        total:                           160352
    transactions:                        10022  (19600.57 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140308 (274407.96 per sec.)
    other operations:                    20044  (39201.14 per sec.)

Test execution summary:
    total time:                          0.5113s
    total number of events:              10022
    total time taken by event execution: 54.9995
    per-request statistics:
         min:                                  1.95ms
         avg:                                  5.49ms
         max:                                 18.81ms
         approx.  95 percentile:               6.99ms

Threads fairness:
    events (avg/stddev):           91.1091/10.59
    execution time (avg/stddev):   0.5000/0.00