work/log.ltccip8.2020-06-14_0656/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-12-2
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=12 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 12

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140224
        write:                           0
        other:                           20032
        total:                           160256
    transactions:                        10016  (5461.43 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140224 (76459.96 per sec.)
    other operations:                    20032  (10922.85 per sec.)

Test execution summary:
    total time:                          1.8340s
    total number of events:              10016
    total time taken by event execution: 21.9075
    per-request statistics:
         min:                                  1.57ms
         avg:                                  2.19ms
         max:                                  3.66ms
         approx.  95 percentile:               2.89ms

Threads fairness:
    events (avg/stddev):           834.6667/129.83
    execution time (avg/stddev):   1.8256/0.00