work/log.ltccip8.2020-06-14_0656/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-21-2
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=21 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 21

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140168
        write:                           0
        other:                           20024
        total:                           160192
    transactions:                        10012  (6872.03 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140168 (96208.48 per sec.)
    other operations:                    20024  (13744.07 per sec.)

Test execution summary:
    total time:                          1.4569s
    total number of events:              10012
    total time taken by event execution: 30.4478
    per-request statistics:
         min:                                  1.57ms
         avg:                                  3.04ms
         max:                                  4.76ms
         approx.  95 percentile:               3.95ms

Threads fairness:
    events (avg/stddev):           476.7619/144.83
    execution time (avg/stddev):   1.4499/0.00