work/log.ltccip8.2020-06-14_0656/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-48-2
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=48 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 48

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140196
        write:                           0
        other:                           20028
        total:                           160224
    transactions:                        10014  (13545.69 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140196 (189639.62 per sec.)
    other operations:                    20028  (27091.37 per sec.)

Test execution summary:
    total time:                          0.7393s
    total number of events:              10014
    total time taken by event execution: 35.1708
    per-request statistics:
         min:                                  1.58ms
         avg:                                  3.51ms
         max:                                  8.23ms
         approx.  95 percentile:               4.84ms

Threads fairness:
    events (avg/stddev):           208.6250/67.64
    execution time (avg/stddev):   0.7327/0.00